app/controllers/pledges_controller.rb

INSERT INTO "pledges" ("amount", "comment", "created_at", "email", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pledge = @project.pledges.new(pledge_params)
    if @pledge.save